## Aggregate operations using groupby

It is for applying multiple functions over selected column or columns      
Aggregations like sum mean median mode std      
Aggregations work only on Numeric fields

##### Import required libraries

In [1]:
import numpy as np
import pandas as pd

In [2]:
ipl_data = {'Team': ['MI', 'MI', 'Devils', 'Devils', 'Kings',
   'CSK', 'CSK', 'CSK', 'MI', 'Royals', 'Royals', 'MI'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0       MI     1  2014     876
1       MI     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5      CSK     4  2015     812
6      CSK     1  2016     756
7      CSK     1  2017     788
8       MI     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11      MI     2  2017     690

In [3]:
# Get year wise addition of points

df.groupby('Year')['Points'].agg(np.sum)

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [4]:
# Get year wise addition of points and rank

df.groupby('Year')[['Points','Rank']].agg(np.sum)

      Points  Rank
Year
2014    3181    10
2015    3078    10
2016    1450     3
2017    1478     3

It will gives total points and rank per year

In [5]:
# Get frequency of each year

df.groupby('Year')['Points'].agg(np.size)

Year
2014    4
2015    4
2016    2
2017    2
Name: Points, dtype: int64

In [6]:
# Get frequency of each team

df.Team.value_counts()

MI        4
CSK       3
Royals    2
Devils    2
Kings     1
Name: Team, dtype: int64

It indicates that MI has played 4 matches whilr CSK has played 3 matches like that

In [7]:
# Get minimum rank of each year

df.groupby('Year')['Rank'].min()

Year
2014    1
2015    1
2016    1
2017    1
Name: Rank, dtype: int64

In [8]:
# Get maximum rank of each year

df.groupby('Year')['Rank'].max()

Year
2014    4
2015    4
2016    2
2017    2
Name: Rank, dtype: int64

In [9]:
# Get maximum rank of each year

df.groupby('Year')['Rank'].agg(np.median)

Year
2014    2.5
2015    2.5
2016    1.5
2017    1.5
Name: Rank, dtype: float64

In [10]:
# Apply multiple aggregate functions on multiple columns

df.groupby('Team')[['Points','Rank']].agg([sum,np.mean,max])

       Points                  Rank
          sum        mean  max  sum  mean max
Team
CSK      2356  785.333333  812    6  2.00   4
Devils   1536  768.000000  863    5  2.50   3
Kings     741  741.000000  741    3  3.00   3
MI       3049  762.250000  876    7  1.75   2
Royals   1505  752.500000  804    5  2.50   4

Here, sum,mean and max aggregate functions are applied on points and Rank column simultaneously